Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_mdma.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32H747_CM4_mdma equates.
 */

#pragma once

#include    <stdint.h>

// MDMA address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    GISR0;
    volatile    uint32_t    RESERVED0[15];
    volatile    uint32_t    C0ISR;
    volatile    uint32_t    C0IFCR;
    volatile    uint32_t    C0ESR;
    volatile    uint32_t    C0CR;
    volatile    uint32_t    C0TCR;
    volatile    uint32_t    C0BNDTR;
    volatile    uint32_t    C0SAR;
    volatile    uint32_t    C0DAR;
    volatile    uint32_t    C0BRUR;
    volatile    uint32_t    C0LAR;
    volatile    uint32_t    C0TBR;
    volatile    uint32_t    RESERVED1;
    volatile    uint32_t    C0MAR;
    volatile    uint32_t    C0MDR;
    volatile    uint32_t    RESERVED2[2];
    volatile    uint32_t    C1ISR;
    volatile    uint32_t    C1IFCR;
    volatile    uint32_t    C1ESR;
    volatile    uint32_t    C1CR;
    volatile    uint32_t    C1TCR;
    volatile    uint32_t    C1BNDTR;
    volatile    uint32_t    C1SAR;
    volatile    uint32_t    C1DAR;
    volatile    uint32_t    C1BRUR;
    volatile    uint32_t    C1LAR;
    volatile    uint32_t    C1TBR;
    volatile    uint32_t    RESERVED3;
    volatile    uint32_t    C1MAR;
    volatile    uint32_t    C1MDR;
    volatile    uint32_t    RESERVED4[2];
    volatile    uint32_t    C2ISR;
    volatile    uint32_t    C2IFCR;
    volatile    uint32_t    C2ESR;
    volatile    uint32_t    C2CR;
    volatile    uint32_t    C2TCR;
    volatile    uint32_t    C2BNDTR;
    volatile    uint32_t    C2SAR;
    volatile    uint32_t    C2DAR;
    volatile    uint32_t    C2BRUR;
    volatile    uint32_t    C2LAR;
    volatile    uint32_t    C2TBR;
    volatile    uint32_t    RESERVED5;
    volatile    uint32_t    C2MAR;
    volatile    uint32_t    C2MDR;
    volatile    uint32_t    RESERVED6[2];
    volatile    uint32_t    C3ISR;
    volatile    uint32_t    C3IFCR;
    volatile    uint32_t    C3ESR;
    volatile    uint32_t    C3CR;
    volatile    uint32_t    C3TCR;
    volatile    uint32_t    C3BNDTR;
    volatile    uint32_t    C3SAR;
    volatile    uint32_t    C3DAR;
    volatile    uint32_t    C3BRUR;
    volatile    uint32_t    C3LAR;
    volatile    uint32_t    C3TBR;
    volatile    uint32_t    RESERVED7;
    volatile    uint32_t    C3MAR;
    volatile    uint32_t    C3MDR;
    volatile    uint32_t    RESERVED8[2];
    volatile    uint32_t    C4ISR;
    volatile    uint32_t    C4IFCR;
    volatile    uint32_t    C4ESR;
    volatile    uint32_t    C4CR;
    volatile    uint32_t    C4TCR;
    volatile    uint32_t    C4BNDTR;
    volatile    uint32_t    C4SAR;
    volatile    uint32_t    C4DAR;
    volatile    uint32_t    C4BRUR;
    volatile    uint32_t    C4LAR;
    volatile    uint32_t    C4TBR;
    volatile    uint32_t    RESERVED9;
    volatile    uint32_t    C4MAR;
    volatile    uint32_t    C4MDR;
    volatile    uint32_t    RESERVED10[2];
    volatile    uint32_t    C5ISR;
    volatile    uint32_t    C5IFCR;
    volatile    uint32_t    C5ESR;
    volatile    uint32_t    C5CR;
    volatile    uint32_t    C5TCR;
    volatile    uint32_t    C5BNDTR;
    volatile    uint32_t    C5SAR;
    volatile    uint32_t    C5DAR;
    volatile    uint32_t    C5BRUR;
    volatile    uint32_t    C5LAR;
    volatile    uint32_t    C5TBR;
    volatile    uint32_t    RESERVED11;
    volatile    uint32_t    C5MAR;
    volatile    uint32_t    C5MDR;
    volatile    uint32_t    RESERVED12[2];
    volatile    uint32_t    C6ISR;
    volatile    uint32_t    C6IFCR;
    volatile    uint32_t    C6ESR;
    volatile    uint32_t    C6CR;
    volatile    uint32_t    C6TCR;
    volatile    uint32_t    C6BNDTR;
    volatile    uint32_t    C6SAR;
    volatile    uint32_t    C6DAR;
    volatile    uint32_t    C6BRUR;
    volatile    uint32_t    C6LAR;
    volatile    uint32_t    C6TBR;
    volatile    uint32_t    RESERVED13;
    volatile    uint32_t    C6MAR;
    volatile    uint32_t    C6MDR;
    volatile    uint32_t    RESERVED14[2];
    volatile    uint32_t    C7ISR;
    volatile    uint32_t    C7IFCR;
    volatile    uint32_t    C7ESR;
    volatile    uint32_t    C7CR;
    volatile    uint32_t    C7TCR;
    volatile    uint32_t    C7BNDTR;
    volatile    uint32_t    C7SAR;
    volatile    uint32_t    C7DAR;
    volatile    uint32_t    C7BRUR;
    volatile    uint32_t    C7LAR;
    volatile    uint32_t    C7TBR;
    volatile    uint32_t    RESERVED15;
    volatile    uint32_t    C7MAR;
    volatile    uint32_t    C7MDR;
    volatile    uint32_t    RESERVED16[2];
    volatile    uint32_t    C8ISR;
    volatile    uint32_t    C8IFCR;
    volatile    uint32_t    C8ESR;
    volatile    uint32_t    C8CR;
    volatile    uint32_t    C8TCR;
    volatile    uint32_t    C8BNDTR;
    volatile    uint32_t    C8SAR;
    volatile    uint32_t    C8DAR;
    volatile    uint32_t    C8BRUR;
    volatile    uint32_t    C8LAR;
    volatile    uint32_t    C8TBR;
    volatile    uint32_t    RESERVED17;
    volatile    uint32_t    C8MAR;
    volatile    uint32_t    C8MDR;
    volatile    uint32_t    RESERVED18[2];
    volatile    uint32_t    C9ISR;
    volatile    uint32_t    C9IFCR;
    volatile    uint32_t    C9ESR;
    volatile    uint32_t    C9CR;
    volatile    uint32_t    C9TCR;
    volatile    uint32_t    C9BNDTR;
    volatile    uint32_t    C9SAR;
    volatile    uint32_t    C9DAR;
    volatile    uint32_t    C9BRUR;
    volatile    uint32_t    C9LAR;
    volatile    uint32_t    C9TBR;
    volatile    uint32_t    RESERVED19;
    volatile    uint32_t    C9MAR;
    volatile    uint32_t    C9MDR;
    volatile    uint32_t    RESERVED20[2];
    volatile    uint32_t    C10ISR;
    volatile    uint32_t    C10IFCR;
    volatile    uint32_t    C10ESR;
    volatile    uint32_t    C10CR;
    volatile    uint32_t    C10TCR;
    volatile    uint32_t    C10BNDTR;
    volatile    uint32_t    C10SAR;
    volatile    uint32_t    C10DAR;
    volatile    uint32_t    C10BRUR;
    volatile    uint32_t    C10LAR;
    volatile    uint32_t    C10TBR;
    volatile    uint32_t    RESERVED21;
    volatile    uint32_t    C10MAR;
    volatile    uint32_t    C10MDR;
    volatile    uint32_t    RESERVED22[2];
    volatile    uint32_t    C11ISR;
    volatile    uint32_t    C11IFCR;
    volatile    uint32_t    C11ESR;
    volatile    uint32_t    C11CR;
    volatile    uint32_t    C11TCR;
    volatile    uint32_t    C11BNDTR;
    volatile    uint32_t    C11SAR;
    volatile    uint32_t    C11DAR;
    volatile    uint32_t    C11BRUR;
    volatile    uint32_t    C11LAR;
    volatile    uint32_t    C11TBR;
    volatile    uint32_t    RESERVED23;
    volatile    uint32_t    C11MAR;
    volatile    uint32_t    C11MDR;
    volatile    uint32_t    RESERVED24[2];
    volatile    uint32_t    C12ISR;
    volatile    uint32_t    C12IFCR;
    volatile    uint32_t    C12ESR;
    volatile    uint32_t    C12CR;
    volatile    uint32_t    C12TCR;
    volatile    uint32_t    C12BNDTR;
    volatile    uint32_t    C12SAR;
    volatile    uint32_t    C12DAR;
    volatile    uint32_t    C12BRUR;
    volatile    uint32_t    C12LAR;
    volatile    uint32_t    C12TBR;
    volatile    uint32_t    RESERVED25;
    volatile    uint32_t    C12MAR;
    volatile    uint32_t    C12MDR;
    volatile    uint32_t    RESERVED26[2];
    volatile    uint32_t    C13ISR;
    volatile    uint32_t    C13IFCR;
    volatile    uint32_t    C13ESR;
    volatile    uint32_t    C13CR;
    volatile    uint32_t    C13TCR;
    volatile    uint32_t    C13BNDTR;
    volatile    uint32_t    C13SAR;
    volatile    uint32_t    C13DAR;
    volatile    uint32_t    C13BRUR;
    volatile    uint32_t    C13LAR;
    volatile    uint32_t    C13TBR;
    volatile    uint32_t    RESERVED27;
    volatile    uint32_t    C13MAR;
    volatile    uint32_t    C13MDR;
    volatile    uint32_t    RESERVED28[2];
    volatile    uint32_t    C14ISR;
    volatile    uint32_t    C14IFCR;
    volatile    uint32_t    C14ESR;
    volatile    uint32_t    C14CR;
    volatile    uint32_t    C14TCR;
    volatile    uint32_t    C14BNDTR;
    volatile    uint32_t    C14SAR;
    volatile    uint32_t    C14DAR;
    volatile    uint32_t    C14BRUR;
    volatile    uint32_t    C14LAR;
    volatile    uint32_t    C14TBR;
    volatile    uint32_t    RESERVED29;
    volatile    uint32_t    C14MAR;
    volatile    uint32_t    C14MDR;
    volatile    uint32_t    RESERVED30[2];
    volatile    uint32_t    C15ISR;
    volatile    uint32_t    C15IFCR;
    volatile    uint32_t    C15ESR;
    volatile    uint32_t    C15CR;
    volatile    uint32_t    C15TCR;
    volatile    uint32_t    C15BNDTR;
    volatile    uint32_t    C15SAR;
    volatile    uint32_t    C15DAR;
    volatile    uint32_t    C15BRUR;
    volatile    uint32_t    C15LAR;
    volatile    uint32_t    C15TBR;
    volatile    uint32_t    RESERVED31;
    volatile    uint32_t    C15MAR;
    volatile    uint32_t    C15MDR;
} MDMA_TypeDef;

#ifdef __cplusplus
#define MDMA    reinterpret_cast<MDMA_TypeDef *>(0x52000000U)

#else
#define MDMA    ((MDMA_TypeDef *)0x52000000U)
#endif

// GISR0 Configuration

#define MDMA_GISR0_GIF15        (0x1U<<15)
#define MDMA_GISR0_GIF14        (0x1U<<14)
#define MDMA_GISR0_GIF13        (0x1U<<13)
#define MDMA_GISR0_GIF12        (0x1U<<12)
#define MDMA_GISR0_GIF11        (0x1U<<11)
#define MDMA_GISR0_GIF10        (0x1U<<10)
#define MDMA_GISR0_GIF9         (0x1U<<9)
#define MDMA_GISR0_GIF8         (0x1U<<8)
#define MDMA_GISR0_GIF7         (0x1U<<7)
#define MDMA_GISR0_GIF6         (0x1U<<6)
#define MDMA_GISR0_GIF5         (0x1U<<5)
#define MDMA_GISR0_GIF4         (0x1U<<4)
#define MDMA_GISR0_GIF3         (0x1U<<3)
#define MDMA_GISR0_GIF2         (0x1U<<2)
#define MDMA_GISR0_GIF1         (0x1U<<1)
#define MDMA_GISR0_GIF0         (0x1U<<0)

// C0ISR Configuration

