Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_mdma.h
// C3SAR Configuration

#define MDMA_C3SAR_SAR          (0xFFFFFFFFU<<0)
#define MDMA_C3SAR_SAR_0        (0x1U<<0)

// C3DAR Configuration

#define MDMA_C3DAR_DAR          (0xFFFFFFFFU<<0)
#define MDMA_C3DAR_DAR_0        (0x1U<<0)

// C3BRUR Configuration

#define MDMA_C3BRUR_DUV         (0xFFFFU<<16)
#define MDMA_C3BRUR_DUV_0       (0x1U<<16)
#define MDMA_C3BRUR_SUV         (0xFFFFU<<0)
#define MDMA_C3BRUR_SUV_0       (0x1U<<0)

// C3LAR Configuration

#define MDMA_C3LAR_LAR          (0xFFFFFFFFU<<0)
#define MDMA_C3LAR_LAR_0        (0x1U<<0)

// C3TBR Configuration

#define MDMA_C3TBR_DBUS         (0x1U<<17)
#define MDMA_C3TBR_SBUS         (0x1U<<16)
#define MDMA_C3TBR_TSEL         (0x3FU<<0)
#define MDMA_C3TBR_TSEL_0       (0x1U<<0)

// C3MAR Configuration

#define MDMA_C3MAR_MAR          (0xFFFFFFFFU<<0)
#define MDMA_C3MAR_MAR_0        (0x1U<<0)

// C3MDR Configuration

#define MDMA_C3MDR_MDR          (0xFFFFFFFFU<<0)
#define MDMA_C3MDR_MDR_0        (0x1U<<0)

// C4ISR Configuration

#define MDMA_C4ISR_CRQA4        (0x1U<<16)
#define MDMA_C4ISR_TCIF4        (0x1U<<4)
#define MDMA_C4ISR_BTIF4        (0x1U<<3)
#define MDMA_C4ISR_BRTIF4       (0x1U<<2)
#define MDMA_C4ISR_CTCIF4       (0x1U<<1)
#define MDMA_C4ISR_TEIF4        (0x1U<<0)

// C4IFCR Configuration

#define MDMA_C4IFCR_CLTCIF4     (0x1U<<4)
#define MDMA_C4IFCR_CBTIF4      (0x1U<<3)
#define MDMA_C4IFCR_CBRTIF4     (0x1U<<2)
#define MDMA_C4IFCR_CCTCIF4     (0x1U<<1)
#define MDMA_C4IFCR_CTEIF4      (0x1U<<0)

// C4ESR Configuration

#define MDMA_C4ESR_BSE          (0x1U<<11)
#define MDMA_C4ESR_ASE          (0x1U<<10)
#define MDMA_C4ESR_TEMD         (0x1U<<9)
#define MDMA_C4ESR_TELD         (0x1U<<8)
#define MDMA_C4ESR_TED          (0x1U<<7)
#define MDMA_C4ESR_TEA          (0x7FU<<0)
#define MDMA_C4ESR_TEA_0        (0x1U<<0)

// C4CR Configuration

#define MDMA_C4CR_SWRQ          (0x1U<<16)
#define MDMA_C4CR_WEX           (0x1U<<14)
#define MDMA_C4CR_HEX           (0x1U<<13)
#define MDMA_C4CR_BEX           (0x1U<<12)
#define MDMA_C4CR_PL            (0x3U<<6)
#define MDMA_C4CR_PL_0          (0x1U<<6)
#define MDMA_C4CR_TCIE          (0x1U<<5)
#define MDMA_C4CR_BTIE          (0x1U<<4)
#define MDMA_C4CR_BRTIE         (0x1U<<3)
#define MDMA_C4CR_CTCIE         (0x1U<<2)
#define MDMA_C4CR_TEIE          (0x1U<<1)
#define MDMA_C4CR_EN            (0x1U<<0)

// C4TCR Configuration

#define MDMA_C4TCR_BWM          (0x1U<<31)
#define MDMA_C4TCR_SWRM         (0x1U<<30)
#define MDMA_C4TCR_TRGM         (0x3U<<28)
#define MDMA_C4TCR_TRGM_0       (0x1U<<28)
#define MDMA_C4TCR_PAM          (0x3U<<26)
#define MDMA_C4TCR_PAM_0        (0x1U<<26)
#define MDMA_C4TCR_PKE          (0x1U<<25)
#define MDMA_C4TCR_TLEN         (0x7FU<<18)
#define MDMA_C4TCR_TLEN_0       (0x1U<<18)
#define MDMA_C4TCR_DBURST       (0x7U<<15)
#define MDMA_C4TCR_DBURST_0     (0x1U<<15)
#define MDMA_C4TCR_SBURST       (0x7U<<12)
#define MDMA_C4TCR_SBURST_0     (0x1U<<12)
#define MDMA_C4TCR_DINCOS       (0x3U<<10)
#define MDMA_C4TCR_DINCOS_0     (0x1U<<10)
#define MDMA_C4TCR_SINCOS       (0x3U<<8)
#define MDMA_C4TCR_SINCOS_0     (0x1U<<8)
#define MDMA_C4TCR_DSIZE        (0x3U<<6)
#define MDMA_C4TCR_DSIZE_0      (0x1U<<6)
#define MDMA_C4TCR_SSIZE        (0x3U<<4)
#define MDMA_C4TCR_SSIZE_0      (0x1U<<4)
#define MDMA_C4TCR_DINC         (0x3U<<2)
#define MDMA_C4TCR_DINC_0       (0x1U<<2)
#define MDMA_C4TCR_SINC         (0x3U<<0)
#define MDMA_C4TCR_SINC_0       (0x1U<<0)

// C4BNDTR Configuration

#define MDMA_C4BNDTR_BRC        (0xFFFU<<20)
#define MDMA_C4BNDTR_BRC_0      (0x1U<<20)
#define MDMA_C4BNDTR_BRDUM      (0x1U<<19)
#define MDMA_C4BNDTR_BRSUM      (0x1U<<18)
#define MDMA_C4BNDTR_BNDT       (0x1FFFFU<<0)
#define MDMA_C4BNDTR_BNDT_0     (0x1U<<0)

// C4SAR Configuration

#define MDMA_C4SAR_SAR          (0xFFFFFFFFU<<0)
#define MDMA_C4SAR_SAR_0        (0x1U<<0)

// C4DAR Configuration

#define MDMA_C4DAR_DAR          (0xFFFFFFFFU<<0)
#define MDMA_C4DAR_DAR_0        (0x1U<<0)

// C4BRUR Configuration

#define MDMA_C4BRUR_DUV         (0xFFFFU<<16)
#define MDMA_C4BRUR_DUV_0       (0x1U<<16)
#define MDMA_C4BRUR_SUV         (0xFFFFU<<0)
#define MDMA_C4BRUR_SUV_0       (0x1U<<0)

// C4LAR Configuration

#define MDMA_C4LAR_LAR          (0xFFFFFFFFU<<0)
#define MDMA_C4LAR_LAR_0        (0x1U<<0)

// C4TBR Configuration

#define MDMA_C4TBR_DBUS         (0x1U<<17)
#define MDMA_C4TBR_SBUS         (0x1U<<16)
#define MDMA_C4TBR_TSEL         (0x3FU<<0)
#define MDMA_C4TBR_TSEL_0       (0x1U<<0)

// C4MAR Configuration

#define MDMA_C4MAR_MAR          (0xFFFFFFFFU<<0)
#define MDMA_C4MAR_MAR_0        (0x1U<<0)

// C4MDR Configuration

#define MDMA_C4MDR_MDR          (0xFFFFFFFFU<<0)
#define MDMA_C4MDR_MDR_0        (0x1U<<0)

// C5ISR Configuration

#define MDMA_C5ISR_CRQA5        (0x1U<<16)
#define MDMA_C5ISR_TCIF5        (0x1U<<4)
#define MDMA_C5ISR_BTIF5        (0x1U<<3)
#define MDMA_C5ISR_BRTIF5       (0x1U<<2)
#define MDMA_C5ISR_CTCIF5       (0x1U<<1)
#define MDMA_C5ISR_TEIF5        (0x1U<<0)

// C5IFCR Configuration

#define MDMA_C5IFCR_CLTCIF5     (0x1U<<4)
#define MDMA_C5IFCR_CBTIF5      (0x1U<<3)
#define MDMA_C5IFCR_CBRTIF5     (0x1U<<2)
#define MDMA_C5IFCR_CCTCIF5     (0x1U<<1)
#define MDMA_C5IFCR_CTEIF5      (0x1U<<0)

// C5ESR Configuration

#define MDMA_C5ESR_BSE          (0x1U<<11)
#define MDMA_C5ESR_ASE          (0x1U<<10)
#define MDMA_C5ESR_TEMD         (0x1U<<9)
#define MDMA_C5ESR_TELD         (0x1U<<8)
#define MDMA_C5ESR_TED          (0x1U<<7)
#define MDMA_C5ESR_TEA          (0x7FU<<0)
#define MDMA_C5ESR_TEA_0        (0x1U<<0)

// C5CR Configuration

#define MDMA_C5CR_SWRQ          (0x1U<<16)
#define MDMA_C5CR_WEX           (0x1U<<14)
#define MDMA_C5CR_HEX           (0x1U<<13)
#define MDMA_C5CR_BEX           (0x1U<<12)
#define MDMA_C5CR_PL            (0x3U<<6)
#define MDMA_C5CR_PL_0          (0x1U<<6)
#define MDMA_C5CR_TCIE          (0x1U<<5)
#define MDMA_C5CR_BTIE          (0x1U<<4)
#define MDMA_C5CR_BRTIE         (0x1U<<3)
#define MDMA_C5CR_CTCIE         (0x1U<<2)
#define MDMA_C5CR_TEIE          (0x1U<<1)
#define MDMA_C5CR_EN            (0x1U<<0)

// C5TCR Configuration

#define MDMA_C5TCR_BWM          (0x1U<<31)
#define MDMA_C5TCR_SWRM         (0x1U<<30)
#define MDMA_C5TCR_TRGM         (0x3U<<28)
#define MDMA_C5TCR_TRGM_0       (0x1U<<28)
#define MDMA_C5TCR_PAM          (0x3U<<26)
#define MDMA_C5TCR_PAM_0        (0x1U<<26)
#define MDMA_C5TCR_PKE          (0x1U<<25)
#define MDMA_C5TCR_TLEN         (0x7FU<<18)
#define MDMA_C5TCR_TLEN_0       (0x1U<<18)
#define MDMA_C5TCR_DBURST       (0x7U<<15)
#define MDMA_C5TCR_DBURST_0     (0x1U<<15)
#define MDMA_C5TCR_SBURST       (0x7U<<12)
#define MDMA_C5TCR_SBURST_0     (0x1U<<12)
#define MDMA_C5TCR_DINCOS       (0x3U<<10)
#define MDMA_C5TCR_DINCOS_0     (0x1U<<10)
#define MDMA_C5TCR_SINCOS       (0x3U<<8)
#define MDMA_C5TCR_SINCOS_0     (0x1U<<8)
#define MDMA_C5TCR_DSIZE        (0x3U<<6)
#define MDMA_C5TCR_DSIZE_0      (0x1U<<6)
#define MDMA_C5TCR_SSIZE        (0x3U<<4)
#define MDMA_C5TCR_SSIZE_0      (0x1U<<4)
#define MDMA_C5TCR_DINC         (0x3U<<2)
#define MDMA_C5TCR_DINC_0       (0x1U<<2)
#define MDMA_C5TCR_SINC         (0x3U<<0)
#define MDMA_C5TCR_SINC_0       (0x1U<<0)

