Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_mdma.h
#define MDMA_C9SAR_SAR          (0xFFFFFFFFU<<0)
#define MDMA_C9SAR_SAR_0        (0x1U<<0)

// C9DAR Configuration

#define MDMA_C9DAR_DAR          (0xFFFFFFFFU<<0)
#define MDMA_C9DAR_DAR_0        (0x1U<<0)

// C9BRUR Configuration

#define MDMA_C9BRUR_DUV         (0xFFFFU<<16)
#define MDMA_C9BRUR_DUV_0       (0x1U<<16)
#define MDMA_C9BRUR_SUV         (0xFFFFU<<0)
#define MDMA_C9BRUR_SUV_0       (0x1U<<0)

// C9LAR Configuration

#define MDMA_C9LAR_LAR          (0xFFFFFFFFU<<0)
#define MDMA_C9LAR_LAR_0        (0x1U<<0)

// C9TBR Configuration

#define MDMA_C9TBR_DBUS         (0x1U<<17)
#define MDMA_C9TBR_SBUS         (0x1U<<16)
#define MDMA_C9TBR_TSEL         (0x3FU<<0)
#define MDMA_C9TBR_TSEL_0       (0x1U<<0)

// C9MAR Configuration

#define MDMA_C9MAR_MAR          (0xFFFFFFFFU<<0)
#define MDMA_C9MAR_MAR_0        (0x1U<<0)

// C9MDR Configuration

#define MDMA_C9MDR_MDR          (0xFFFFFFFFU<<0)
#define MDMA_C9MDR_MDR_0        (0x1U<<0)

// C10ISR Configuration

#define MDMA_C10ISR_CRQA10      (0x1U<<16)
#define MDMA_C10ISR_TCIF10      (0x1U<<4)
#define MDMA_C10ISR_BTIF10      (0x1U<<3)
#define MDMA_C10ISR_BRTIF10     (0x1U<<2)
#define MDMA_C10ISR_CTCIF10     (0x1U<<1)
#define MDMA_C10ISR_TEIF10      (0x1U<<0)

// C10IFCR Configuration

#define MDMA_C10IFCR_CLTCIF10   (0x1U<<4)
#define MDMA_C10IFCR_CBTIF10    (0x1U<<3)
#define MDMA_C10IFCR_CBRTIF10   (0x1U<<2)
#define MDMA_C10IFCR_CCTCIF10   (0x1U<<1)
#define MDMA_C10IFCR_CTEIF10    (0x1U<<0)

// C10ESR Configuration

#define MDMA_C10ESR_BSE         (0x1U<<11)
#define MDMA_C10ESR_ASE         (0x1U<<10)
#define MDMA_C10ESR_TEMD        (0x1U<<9)
#define MDMA_C10ESR_TELD        (0x1U<<8)
#define MDMA_C10ESR_TED         (0x1U<<7)
#define MDMA_C10ESR_TEA         (0x7FU<<0)
#define MDMA_C10ESR_TEA_0       (0x1U<<0)

// C10CR Configuration

#define MDMA_C10CR_SWRQ         (0x1U<<16)
#define MDMA_C10CR_WEX          (0x1U<<14)
#define MDMA_C10CR_HEX          (0x1U<<13)
#define MDMA_C10CR_BEX          (0x1U<<12)
#define MDMA_C10CR_PL           (0x3U<<6)
#define MDMA_C10CR_PL_0         (0x1U<<6)
#define MDMA_C10CR_TCIE         (0x1U<<5)
#define MDMA_C10CR_BTIE         (0x1U<<4)
#define MDMA_C10CR_BRTIE        (0x1U<<3)
#define MDMA_C10CR_CTCIE        (0x1U<<2)
#define MDMA_C10CR_TEIE         (0x1U<<1)
#define MDMA_C10CR_EN           (0x1U<<0)

// C10TCR Configuration

#define MDMA_C10TCR_BWM         (0x1U<<31)
#define MDMA_C10TCR_SWRM        (0x1U<<30)
#define MDMA_C10TCR_TRGM        (0x3U<<28)
#define MDMA_C10TCR_TRGM_0      (0x1U<<28)
#define MDMA_C10TCR_PAM         (0x3U<<26)
#define MDMA_C10TCR_PAM_0       (0x1U<<26)
#define MDMA_C10TCR_PKE         (0x1U<<25)
#define MDMA_C10TCR_TLEN        (0x7FU<<18)
#define MDMA_C10TCR_TLEN_0      (0x1U<<18)
#define MDMA_C10TCR_DBURST      (0x7U<<15)
#define MDMA_C10TCR_DBURST_0    (0x1U<<15)
#define MDMA_C10TCR_SBURST      (0x7U<<12)
#define MDMA_C10TCR_SBURST_0    (0x1U<<12)
#define MDMA_C10TCR_DINCOS      (0x3U<<10)
#define MDMA_C10TCR_DINCOS_0    (0x1U<<10)
#define MDMA_C10TCR_SINCOS      (0x3U<<8)
#define MDMA_C10TCR_SINCOS_0    (0x1U<<8)
#define MDMA_C10TCR_DSIZE       (0x3U<<6)
#define MDMA_C10TCR_DSIZE_0     (0x1U<<6)
#define MDMA_C10TCR_SSIZE       (0x3U<<4)
#define MDMA_C10TCR_SSIZE_0     (0x1U<<4)
#define MDMA_C10TCR_DINC        (0x3U<<2)
#define MDMA_C10TCR_DINC_0      (0x1U<<2)
#define MDMA_C10TCR_SINC        (0x3U<<0)
#define MDMA_C10TCR_SINC_0      (0x1U<<0)

// C10BNDTR Configuration

#define MDMA_C10BNDTR_BRC       (0xFFFU<<20)
#define MDMA_C10BNDTR_BRC_0     (0x1U<<20)
#define MDMA_C10BNDTR_BRDUM     (0x1U<<19)
#define MDMA_C10BNDTR_BRSUM     (0x1U<<18)
#define MDMA_C10BNDTR_BNDT      (0x1FFFFU<<0)
#define MDMA_C10BNDTR_BNDT_0    (0x1U<<0)

// C10SAR Configuration

#define MDMA_C10SAR_SAR         (0xFFFFFFFFU<<0)
#define MDMA_C10SAR_SAR_0       (0x1U<<0)

// C10DAR Configuration

#define MDMA_C10DAR_DAR         (0xFFFFFFFFU<<0)
#define MDMA_C10DAR_DAR_0       (0x1U<<0)

// C10BRUR Configuration

#define MDMA_C10BRUR_DUV        (0xFFFFU<<16)
#define MDMA_C10BRUR_DUV_0      (0x1U<<16)
#define MDMA_C10BRUR_SUV        (0xFFFFU<<0)
#define MDMA_C10BRUR_SUV_0      (0x1U<<0)

// C10LAR Configuration

#define MDMA_C10LAR_LAR         (0xFFFFFFFFU<<0)
#define MDMA_C10LAR_LAR_0       (0x1U<<0)

// C10TBR Configuration

#define MDMA_C10TBR_DBUS        (0x1U<<17)
#define MDMA_C10TBR_SBUS        (0x1U<<16)
#define MDMA_C10TBR_TSEL        (0x3FU<<0)
#define MDMA_C10TBR_TSEL_0      (0x1U<<0)

// C10MAR Configuration

#define MDMA_C10MAR_MAR         (0xFFFFFFFFU<<0)
#define MDMA_C10MAR_MAR_0       (0x1U<<0)

// C10MDR Configuration

#define MDMA_C10MDR_MDR         (0xFFFFFFFFU<<0)
#define MDMA_C10MDR_MDR_0       (0x1U<<0)

// C11ISR Configuration

#define MDMA_C11ISR_CRQA11      (0x1U<<16)
#define MDMA_C11ISR_TCIF11      (0x1U<<4)
#define MDMA_C11ISR_BTIF11      (0x1U<<3)
#define MDMA_C11ISR_BRTIF11     (0x1U<<2)
#define MDMA_C11ISR_CTCIF11     (0x1U<<1)
#define MDMA_C11ISR_TEIF11      (0x1U<<0)

// C11IFCR Configuration

#define MDMA_C11IFCR_CLTCIF11   (0x1U<<4)
#define MDMA_C11IFCR_CBTIF11    (0x1U<<3)
#define MDMA_C11IFCR_CBRTIF11   (0x1U<<2)
#define MDMA_C11IFCR_CCTCIF11   (0x1U<<1)
#define MDMA_C11IFCR_CTEIF11    (0x1U<<0)

// C11ESR Configuration

#define MDMA_C11ESR_BSE         (0x1U<<11)
#define MDMA_C11ESR_ASE         (0x1U<<10)
#define MDMA_C11ESR_TEMD        (0x1U<<9)
#define MDMA_C11ESR_TELD        (0x1U<<8)
#define MDMA_C11ESR_TED         (0x1U<<7)
#define MDMA_C11ESR_TEA         (0x7FU<<0)
#define MDMA_C11ESR_TEA_0       (0x1U<<0)

// C11CR Configuration

#define MDMA_C11CR_SWRQ         (0x1U<<16)
#define MDMA_C11CR_WEX          (0x1U<<14)
#define MDMA_C11CR_HEX          (0x1U<<13)
#define MDMA_C11CR_BEX          (0x1U<<12)
#define MDMA_C11CR_PL           (0x3U<<6)
#define MDMA_C11CR_PL_0         (0x1U<<6)
#define MDMA_C11CR_TCIE         (0x1U<<5)
#define MDMA_C11CR_BTIE         (0x1U<<4)
#define MDMA_C11CR_BRTIE        (0x1U<<3)
#define MDMA_C11CR_CTCIE        (0x1U<<2)
#define MDMA_C11CR_TEIE         (0x1U<<1)
#define MDMA_C11CR_EN           (0x1U<<0)

// C11TCR Configuration

#define MDMA_C11TCR_BWM         (0x1U<<31)
#define MDMA_C11TCR_SWRM        (0x1U<<30)
#define MDMA_C11TCR_TRGM        (0x3U<<28)
#define MDMA_C11TCR_TRGM_0      (0x1U<<28)
#define MDMA_C11TCR_PAM         (0x3U<<26)
#define MDMA_C11TCR_PAM_0       (0x1U<<26)
#define MDMA_C11TCR_PKE         (0x1U<<25)
#define MDMA_C11TCR_TLEN        (0x7FU<<18)
#define MDMA_C11TCR_TLEN_0      (0x1U<<18)
#define MDMA_C11TCR_DBURST      (0x7U<<15)
#define MDMA_C11TCR_DBURST_0    (0x1U<<15)
#define MDMA_C11TCR_SBURST      (0x7U<<12)
#define MDMA_C11TCR_SBURST_0    (0x1U<<12)
#define MDMA_C11TCR_DINCOS      (0x3U<<10)
#define MDMA_C11TCR_DINCOS_0    (0x1U<<10)
#define MDMA_C11TCR_SINCOS      (0x3U<<8)
#define MDMA_C11TCR_SINCOS_0    (0x1U<<8)
#define MDMA_C11TCR_DSIZE       (0x3U<<6)
#define MDMA_C11TCR_DSIZE_0     (0x1U<<6)
#define MDMA_C11TCR_SSIZE       (0x3U<<4)
#define MDMA_C11TCR_SSIZE_0     (0x1U<<4)
#define MDMA_C11TCR_DINC        (0x3U<<2)
#define MDMA_C11TCR_DINC_0      (0x1U<<2)
#define MDMA_C11TCR_SINC        (0x3U<<0)
#define MDMA_C11TCR_SINC_0      (0x1U<<0)

// C11BNDTR Configuration

#define MDMA_C11BNDTR_BRC       (0xFFFU<<20)
#define MDMA_C11BNDTR_BRC_0     (0x1U<<20)
#define MDMA_C11BNDTR_BRDUM     (0x1U<<19)
#define MDMA_C11BNDTR_BRSUM     (0x1U<<18)
#define MDMA_C11BNDTR_BNDT      (0x1FFFFU<<0)
#define MDMA_C11BNDTR_BNDT_0    (0x1U<<0)

// C11SAR Configuration

