Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_mdma.h
#define MDMA_C11SAR_SAR         (0xFFFFFFFFU<<0)
#define MDMA_C11SAR_SAR_0       (0x1U<<0)

// C11DAR Configuration

#define MDMA_C11DAR_DAR         (0xFFFFFFFFU<<0)
#define MDMA_C11DAR_DAR_0       (0x1U<<0)

// C11BRUR Configuration

#define MDMA_C11BRUR_DUV        (0xFFFFU<<16)
#define MDMA_C11BRUR_DUV_0      (0x1U<<16)
#define MDMA_C11BRUR_SUV        (0xFFFFU<<0)
#define MDMA_C11BRUR_SUV_0      (0x1U<<0)

// C11LAR Configuration

#define MDMA_C11LAR_LAR         (0xFFFFFFFFU<<0)
#define MDMA_C11LAR_LAR_0       (0x1U<<0)

// C11TBR Configuration

#define MDMA_C11TBR_DBUS        (0x1U<<17)
#define MDMA_C11TBR_SBUS        (0x1U<<16)
#define MDMA_C11TBR_TSEL        (0x3FU<<0)
#define MDMA_C11TBR_TSEL_0      (0x1U<<0)

// C11MAR Configuration

#define MDMA_C11MAR_MAR         (0xFFFFFFFFU<<0)
#define MDMA_C11MAR_MAR_0       (0x1U<<0)

// C11MDR Configuration

#define MDMA_C11MDR_MDR         (0xFFFFFFFFU<<0)
#define MDMA_C11MDR_MDR_0       (0x1U<<0)

// C12ISR Configuration

#define MDMA_C12ISR_CRQA12      (0x1U<<16)
#define MDMA_C12ISR_TCIF12      (0x1U<<4)
#define MDMA_C12ISR_BTIF12      (0x1U<<3)
#define MDMA_C12ISR_BRTIF12     (0x1U<<2)
#define MDMA_C12ISR_CTCIF12     (0x1U<<1)
#define MDMA_C12ISR_TEIF12      (0x1U<<0)

// C12IFCR Configuration

#define MDMA_C12IFCR_CLTCIF12   (0x1U<<4)
#define MDMA_C12IFCR_CBTIF12    (0x1U<<3)
#define MDMA_C12IFCR_CBRTIF12   (0x1U<<2)
#define MDMA_C12IFCR_CCTCIF12   (0x1U<<1)
#define MDMA_C12IFCR_CTEIF12    (0x1U<<0)

// C12ESR Configuration

#define MDMA_C12ESR_BSE         (0x1U<<11)
#define MDMA_C12ESR_ASE         (0x1U<<10)
#define MDMA_C12ESR_TEMD        (0x1U<<9)
#define MDMA_C12ESR_TELD        (0x1U<<8)
#define MDMA_C12ESR_TED         (0x1U<<7)
#define MDMA_C12ESR_TEA         (0x7FU<<0)
#define MDMA_C12ESR_TEA_0       (0x1U<<0)

// C12CR Configuration

#define MDMA_C12CR_SWRQ         (0x1U<<16)
#define MDMA_C12CR_WEX          (0x1U<<14)
#define MDMA_C12CR_HEX          (0x1U<<13)
#define MDMA_C12CR_BEX          (0x1U<<12)
#define MDMA_C12CR_PL           (0x3U<<6)
#define MDMA_C12CR_PL_0         (0x1U<<6)
#define MDMA_C12CR_TCIE         (0x1U<<5)
#define MDMA_C12CR_BTIE         (0x1U<<4)
#define MDMA_C12CR_BRTIE        (0x1U<<3)
#define MDMA_C12CR_CTCIE        (0x1U<<2)
#define MDMA_C12CR_TEIE         (0x1U<<1)
#define MDMA_C12CR_EN           (0x1U<<0)

// C12TCR Configuration

#define MDMA_C12TCR_BWM         (0x1U<<31)
#define MDMA_C12TCR_SWRM        (0x1U<<30)
#define MDMA_C12TCR_TRGM        (0x3U<<28)
#define MDMA_C12TCR_TRGM_0      (0x1U<<28)
#define MDMA_C12TCR_PAM         (0x3U<<26)
#define MDMA_C12TCR_PAM_0       (0x1U<<26)
#define MDMA_C12TCR_PKE         (0x1U<<25)
#define MDMA_C12TCR_TLEN        (0x7FU<<18)
#define MDMA_C12TCR_TLEN_0      (0x1U<<18)
#define MDMA_C12TCR_DBURST      (0x7U<<15)
#define MDMA_C12TCR_DBURST_0    (0x1U<<15)
#define MDMA_C12TCR_SBURST      (0x7U<<12)
#define MDMA_C12TCR_SBURST_0    (0x1U<<12)
#define MDMA_C12TCR_DINCOS      (0x3U<<10)
#define MDMA_C12TCR_DINCOS_0    (0x1U<<10)
#define MDMA_C12TCR_SINCOS      (0x3U<<8)
#define MDMA_C12TCR_SINCOS_0    (0x1U<<8)
#define MDMA_C12TCR_DSIZE       (0x3U<<6)
#define MDMA_C12TCR_DSIZE_0     (0x1U<<6)
#define MDMA_C12TCR_SSIZE       (0x3U<<4)
#define MDMA_C12TCR_SSIZE_0     (0x1U<<4)
#define MDMA_C12TCR_DINC        (0x3U<<2)
#define MDMA_C12TCR_DINC_0      (0x1U<<2)
#define MDMA_C12TCR_SINC        (0x3U<<0)
#define MDMA_C12TCR_SINC_0      (0x1U<<0)

// C12BNDTR Configuration

#define MDMA_C12BNDTR_BRC       (0xFFFU<<20)
#define MDMA_C12BNDTR_BRC_0     (0x1U<<20)
#define MDMA_C12BNDTR_BRDUM     (0x1U<<19)
#define MDMA_C12BNDTR_BRSUM     (0x1U<<18)
#define MDMA_C12BNDTR_BNDT      (0x1FFFFU<<0)
#define MDMA_C12BNDTR_BNDT_0    (0x1U<<0)

// C12SAR Configuration

#define MDMA_C12SAR_SAR         (0xFFFFFFFFU<<0)
#define MDMA_C12SAR_SAR_0       (0x1U<<0)

// C12DAR Configuration

#define MDMA_C12DAR_DAR         (0xFFFFFFFFU<<0)
#define MDMA_C12DAR_DAR_0       (0x1U<<0)

// C12BRUR Configuration

#define MDMA_C12BRUR_DUV        (0xFFFFU<<16)
#define MDMA_C12BRUR_DUV_0      (0x1U<<16)
#define MDMA_C12BRUR_SUV        (0xFFFFU<<0)
#define MDMA_C12BRUR_SUV_0      (0x1U<<0)

// C12LAR Configuration

#define MDMA_C12LAR_LAR         (0xFFFFFFFFU<<0)
#define MDMA_C12LAR_LAR_0       (0x1U<<0)

// C12TBR Configuration

#define MDMA_C12TBR_DBUS        (0x1U<<17)
#define MDMA_C12TBR_SBUS        (0x1U<<16)
#define MDMA_C12TBR_TSEL        (0x3FU<<0)
#define MDMA_C12TBR_TSEL_0      (0x1U<<0)

// C12MAR Configuration

#define MDMA_C12MAR_MAR         (0xFFFFFFFFU<<0)
#define MDMA_C12MAR_MAR_0       (0x1U<<0)

// C12MDR Configuration

#define MDMA_C12MDR_MDR         (0xFFFFFFFFU<<0)
#define MDMA_C12MDR_MDR_0       (0x1U<<0)

// C13ISR Configuration

#define MDMA_C13ISR_CRQA13      (0x1U<<16)
#define MDMA_C13ISR_TCIF13      (0x1U<<4)
#define MDMA_C13ISR_BTIF13      (0x1U<<3)
#define MDMA_C13ISR_BRTIF13     (0x1U<<2)
#define MDMA_C13ISR_CTCIF13     (0x1U<<1)
#define MDMA_C13ISR_TEIF13      (0x1U<<0)

// C13IFCR Configuration

#define MDMA_C13IFCR_CLTCIF13   (0x1U<<4)
#define MDMA_C13IFCR_CBTIF13    (0x1U<<3)
#define MDMA_C13IFCR_CBRTIF13   (0x1U<<2)
#define MDMA_C13IFCR_CCTCIF13   (0x1U<<1)
#define MDMA_C13IFCR_CTEIF13    (0x1U<<0)

// C13ESR Configuration

#define MDMA_C13ESR_BSE         (0x1U<<11)
#define MDMA_C13ESR_ASE         (0x1U<<10)
#define MDMA_C13ESR_TEMD        (0x1U<<9)
#define MDMA_C13ESR_TELD        (0x1U<<8)
#define MDMA_C13ESR_TED         (0x1U<<7)
#define MDMA_C13ESR_TEA         (0x7FU<<0)
#define MDMA_C13ESR_TEA_0       (0x1U<<0)

// C13CR Configuration

#define MDMA_C13CR_SWRQ         (0x1U<<16)
#define MDMA_C13CR_WEX          (0x1U<<14)
#define MDMA_C13CR_HEX          (0x1U<<13)
#define MDMA_C13CR_BEX          (0x1U<<12)
#define MDMA_C13CR_PL           (0x3U<<6)
#define MDMA_C13CR_PL_0         (0x1U<<6)
#define MDMA_C13CR_TCIE         (0x1U<<5)
#define MDMA_C13CR_BTIE         (0x1U<<4)
#define MDMA_C13CR_BRTIE        (0x1U<<3)
#define MDMA_C13CR_CTCIE        (0x1U<<2)
#define MDMA_C13CR_TEIE         (0x1U<<1)
#define MDMA_C13CR_EN           (0x1U<<0)

// C13TCR Configuration

#define MDMA_C13TCR_BWM         (0x1U<<31)
#define MDMA_C13TCR_SWRM        (0x1U<<30)
#define MDMA_C13TCR_TRGM        (0x3U<<28)
#define MDMA_C13TCR_TRGM_0      (0x1U<<28)
#define MDMA_C13TCR_PAM         (0x3U<<26)
#define MDMA_C13TCR_PAM_0       (0x1U<<26)
#define MDMA_C13TCR_PKE         (0x1U<<25)
#define MDMA_C13TCR_TLEN        (0x7FU<<18)
#define MDMA_C13TCR_TLEN_0      (0x1U<<18)
#define MDMA_C13TCR_DBURST      (0x7U<<15)
#define MDMA_C13TCR_DBURST_0    (0x1U<<15)
#define MDMA_C13TCR_SBURST      (0x7U<<12)
#define MDMA_C13TCR_SBURST_0    (0x1U<<12)
#define MDMA_C13TCR_DINCOS      (0x3U<<10)
#define MDMA_C13TCR_DINCOS_0    (0x1U<<10)
#define MDMA_C13TCR_SINCOS      (0x3U<<8)
#define MDMA_C13TCR_SINCOS_0    (0x1U<<8)
#define MDMA_C13TCR_DSIZE       (0x3U<<6)
#define MDMA_C13TCR_DSIZE_0     (0x1U<<6)
#define MDMA_C13TCR_SSIZE       (0x3U<<4)
#define MDMA_C13TCR_SSIZE_0     (0x1U<<4)
#define MDMA_C13TCR_DINC        (0x3U<<2)
#define MDMA_C13TCR_DINC_0      (0x1U<<2)
#define MDMA_C13TCR_SINC        (0x3U<<0)
#define MDMA_C13TCR_SINC_0      (0x1U<<0)

// C13BNDTR Configuration

#define MDMA_C13BNDTR_BRC       (0xFFFU<<20)
#define MDMA_C13BNDTR_BRC_0     (0x1U<<20)
#define MDMA_C13BNDTR_BRDUM     (0x1U<<19)
#define MDMA_C13BNDTR_BRSUM     (0x1U<<18)
#define MDMA_C13BNDTR_BNDT      (0x1FFFFU<<0)
#define MDMA_C13BNDTR_BNDT_0    (0x1U<<0)

// C13SAR Configuration

#define MDMA_C13SAR_SAR         (0xFFFFFFFFU<<0)
#define MDMA_C13SAR_SAR_0       (0x1U<<0)

